src/InformationRegisters/СтатистикаФайлыТехжурналов/СтатистикаФайлыТехжурналов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаФайлыТехжурналов</name>
  <resources>
    <name>ПозицияЧтения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПолноеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатистикаФайлыТехжурналов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьПозициюЧтения(ПолноеИмяФайла) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатистикаФайлыТехжурналов.ПозицияЧтения КАК ПозицияЧтения
	|ИЗ
	|	РегистрСведений.СтатистикаФайлыТехжурналов КАК СтатистикаФайлыТехжурналов
	|ГДЕ
	|	СтатистикаФайлыТехжурналов.ПолноеИмяФайла = &ПолноеИмяФайла
	|";
	Запрос.УстановитьПараметр("ПолноеИмяФайла", ПолноеИмяФайла);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ДобавитьФайл(ПолноеИмяФайла);
		Возврат 0;
	Иначе
		Возврат Результат.Выгрузить()[0].ПозицияЧтения;
	КонецЕсли;
КонецФункции

Процедура УстановитьПозициюЧтения(ПолноеИмяФайла, ПозицияЧтения) Экспорт
	НаборЗаписей = РегистрыСведений.СтатистикаФайлыТехжурналов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПолноеИмяФайла.Установить(ПолноеИмяФайла);
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.ПолноеИмяФайла = ПолноеИмяФайла;
	НовЗапись.ПозицияЧтения = ПозицияЧтения;
	
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

Процедура ДобавитьФайл(ПолноеИмяФайла)
	НаборЗаписей = РегистрыСведений.СтатистикаФайлыТехжурналов.СоздатьНаборЗаписей();
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.ПолноеИмяФайла = ПолноеИмяФайла;
	НовЗапись.ПозицияЧтения = 0;
	Если ПараметрыСеанса.ВерсияПлатформы > 8000300000000000 Тогда
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
	КонецЕсли;
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

#КонецЕсли
